//
//  AssignmentData.swift
//  OhWedding
//
//  Created by Buikliskii Vladimir on 10.05.2025.
//

import Foundation

struct AssignmentData {
    static let assignments: [Assignment] = [
        Assignment(
            title: "Скачать Pinterest и создать доску «Моя свадьба»",
            detail: "Сохранять в муд борд абсолютно все, что привлекает внимание: декор, платья, торты, идеи, а также сохранять то, что не нравится, это тоже отличный референс «как не надо».",
            isCompleted: false
        ),
        Assignment(
            title: "Список гостей",
            detail: "Составляйте список гостей в онлайн формате, сразу распределяя их на компанию по интересам и выписывая Семья Имя, это пригодится вам для рассадки и приглашений.",
            isCompleted: false
        ),
        Assignment(
            title: "Дата/Локация",
            detail: "Только после согласования этих двух знаменателей можно приступать к следующим процессам.",
            isCompleted: false
        ),
        Assignment(
            title: "Платье/Костюм",
            detail: "Лучше отталкиваться от уже согласованного образа невесты в декоре, уже получив предложение можно идти исследовать свадебные магазины, но советую не покупать его сильно заранее, может разонравиться или смениться тренд.",
            isCompleted: false
        ),
        Assignment(
            title: "Кольца",
            detail: "Можно покупать или заказывать сильно заранее.",
            isCompleted: false
        ),
        Assignment(
            title: "Укладка/Макияж",
            detail: "От этих специалистов зависит настроение невесты в день свадьбы, поэтому стоит бронировать их как только вы определились с датой свадьбы.",
            isCompleted: false
        ),
        Assignment(
            title: "Отпуск",
            detail: "Планирование поездки тоже лучше начать заранее.",
            isCompleted: false
        )
    ]
}
